-- 重新设置字符格式命令
set character_set_client=utf8;
set character_set_connection=utf8;
set character_set_database=utf8mb4;
set character_set_results=gb2312;
set character_set_server=utf8;

INSERT INTO baike(`title`,`content`)value('狗','

狗（拉丁学名：Canis lupus familiaris）属于脊索动物门、脊椎动物亚门、哺乳纲、真兽亚纲、食肉目、裂脚亚目、犬科动物。分布于世界各地。与马、牛、羊、猪、鸡并称“六畜”。有科学家认为狗是由早期人类从灰狼驯化而来，驯养时间在4万年前~1.5万年前，发展至今日。被称为“人类最忠实的朋友”，现如今是饲养率最高的宠物。其寿命约十多年。在中国文化中，狗属于十二生肖之一，在十二生肖中的第11位。
');
INSERT INTO baike(`title`,`content`)value('北京','北京（简称：京），是中华人民共和国的首都，全国政治、文化、国际交往、科技创新的中心，是中共中央委员会、中华人民共和国中央人民政府、全国人民代表大会、中国人民政治协商会议全国委员会、中共中央军事委员会所在地，也是中部战区司令部驻地。它是首批国家历史文化名城和世界上拥有世界文化遗产数最多的城市。 北京位于华北平原北部，背靠燕山，毗邻天津和河北，总面积16410.54平方千米。七十万年前周口店地区出现北京猿人。…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('上海','上海（简称：沪、申），是中国国家中心城市，沪杭甬大湾区核心城市，是国际经济、金融、贸易、航运、科技创新中心，是首批沿海开放城市。上海地处长江入海口，是长江经济带的龙头城市，隔东中国海与日本九州岛相望，南濒杭州湾，北、西与江苏、浙江两省相接。 上海港货物吞吐量和集装箱吞吐量均居世界第一，是江海国际性港口，设中国大陆首个自贸区中国（上海）自由贸易试验区。上海市与安徽、江苏、浙江共同构成了长江三角洲城市…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('广州','广州（简称穗），别称羊城、花城，广东省省会，是国际大都市、国际商贸中心、国际综合交通枢纽，首批沿海开放城市，也是南部战区司令部驻地，是粤港澳大湾区、泛珠江三角洲经济区的核心城市以及一带一路的枢纽城市。 广州地处中国南部、广东省中南部，东连博罗县，西邻顺德，北靠清远市区，南接东莞市和中山市；属亚热带季风气候，著名景点有花城广场、广州塔。秦末期为南越国；东汉末年，广州属于吴国；1954年全国行政区域调整时…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('深圳','深圳（简称“深”），别称“鹏城”，广东省省辖市，全国经济中心城市和国际化城市、国际科技产业创新中心、全球海洋中心城市、中国三大全国性金融中心之一，是中国设立的第一个经济特区。因其水泽密布，村落边有一条深水沟而得名深圳。 深圳地处广东南部，东临大亚湾，西濒珠江口，南隔深圳河与香港相连，北部与东莞、惠州接壤；属亚热带季风气候，著名景点有世界之窗、东部华侨城等。清朝初年建墟；1979年成立深圳市；1980年8月…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('天津','天津（简称津），中华人民共和国直辖市，国家中心城市、超大城市、环渤海地区经济中心、首批沿海开放城市，全国先进制造研发基地、北方国际航运核心区、金融创新运营示范区、改革开放先行区。 天津位于华北平原海河五大支流汇流处，东临渤海，北依燕山；属暖温带半湿润大陆季风型气候，著名景点有五大道、天津之眼等。辽朝在武清设立了“榷盐院”，管理盐务；永乐二年（1404年12月23日）此地改名为天津；1967年1月恢复直辖市。
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('杭州','杭州（简称“杭”），浙江省省会，位于中国东南沿海、浙江省北部，副省级市。 杭州自秦朝设县治以来已有2200多年的历史，曾是吴越国和南宋的都城。杭州也是浙江省的政治、经济、文化、教育、交通和金融中心，是长江三角洲城市群中心城市之一、环杭州湾大湾区核心城市、长三角宁杭生态经济带节点城市、中国重要的电子商务中心之一。
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('西安','西安，古称长安、镐京，陕西省会、副省级市，是世界历史名城、中国四大古都之一、中华文明和中华民族重要发祥地，是国家重要的科研、教育、工业基地，亦是丝绸之路起点城市、“一带一路”核心区。 北临渭河、黄土高原，南邻秦岭，东与华县、渭南市、商州区、洛南县相接，西与眉县、太白县接壤；总面积10752平方公里，景点有兵马俑、钟鼓楼等。1927年11月25日，设立西安市；1954年6月19日，为省辖市。
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('成都','成都（简称：蓉），别称蓉城、锦城，是四川省省会，是国家重要的高新技术产业基地、商贸物流中心，亦是国家历史文化名城，古蜀文明发祥地，中国十大古都之一。 公元前四世纪，开明王朝九世以“一年成聚，二年成邑，三年成都”，故名成都；先后有7个割据政权在此建都。成都拥有都江堰、武侯祠、杜甫草堂、金沙遗址等名胜古迹，是中国最佳旅游城市。成都因地处川西盆地，河网纵横、物产丰富，自古享有“天府之国”的美誉。
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('香港','香港（Hong Kong，缩写HK，简称“港”），全称中华人民共和国香港特别行政区，是全球第三大金融中心，与纽约、伦敦并称为“纽伦港”，有“东方之珠”“美食天堂”“购物天堂”等美誉。 香港地处中国华南地区，珠江口以东，南海沿岸，北接广东省深圳市，西接珠江，与澳门特别行政区、珠海市以及中山市隔着珠江口相望，全境由香港岛、九龙半岛、新界等3大区域组成。香港自古以来就是中国的领土，1997年7月1日，中华人民共和国恢复…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('澳门','澳门（葡语Macau、英语Macao），别名妈港、濠江、梳打埠等，全称为中华人民共和国澳门特别行政区，是一个国际自由港，是世界人口密度最高的地区之一，也是世界四大赌城之一。 澳门以前是个小渔村，1999年12月20日中国政府恢复对澳门行使主权。澳门属亚热带季风气候，著名景点有澳门历史城区、大三巴牌坊、观光塔等。
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('台北','台北（Taipei），简称“北”，又称北市，是中国台湾省省会。位于台湾岛北部的台北盆地，被新北市环绕，西界淡水河及其支流新店溪，东至南港附近，南至木栅以南丘陵区，北包大屯山东南麓。 台北是台湾省的六个“直辖市”之一，也是台湾省的政治、经济、文化、旅游、工业、商业与传播中心，仅次于新北市的台湾第二大城市。 台北包括由同台北市外的基隆市、新北市的芦洲、三重、新庄、板桥、中和、永和、新店、汐止、树林、土城、五…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('珠海','珠海市，广东省下辖地级市，别名百岛之市、浪漫之城。 汉初为南越国辖地。汉元鼎六年（公元前111年），属番禺县辖地，直至东汉。建国后，隶属珠江专区，1979年3月，改为珠海市；11月定为省辖市。珠海属亚热带季风气候，著名景点有长隆海洋王国、珠海渔女雕像、情侣路、海泉湾、珠海大剧院等。
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('郑州','郑州，别名商都、绿城，河南省省会，是中国中部地区重要的中心城市、国家重要的综合交通枢纽、中原经济区核心城市，郑州是中华人文始祖轩辕黄帝的故里，是“中国八大古都”之一和世界历史都市联盟成员。 地处华北平原南部、黄河下游，居河南省中部偏北，东接开封市，西依洛阳市。郑州地处中原腹地，属温带季风气候，四季分明，地势西南高、东北低。2018年末，郑州下辖6个市辖区、1个县，代管5个县级市，总面积7446平方公里，建成…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('厦门','厦门（简称：鹭），别称鹭岛，隶属于福建省，副省级城市、经济特区，东南沿海重要的中心城市、港口及风景旅游城市。位于福建省东南端， 西界漳州， 北邻南安和晋江，东南与大小金门和大担岛隔海相望，通行闽南方言，是闽南地区的主要城市，与漳州、泉州并称厦漳泉闽南金三角经济区。 1980年10月7日，批复设立经济特区，厦门先后获批开发开放类国家综合配套改革试验区（即“新特区”），自由贸易试验区，厦门已成为两岸新兴产业和…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('青岛','青岛（简称青），旧称“胶澳”，别称“琴岛”、“岛城”，隶属山东省，是世界啤酒之城、世界帆船之都、全国首批沿海开放城市、国家卫生城市，被誉为“东方瑞士”，因古代渔村青岛得名。 青岛地处山东半岛南部，东北与烟台市毗邻，西与潍坊市相连，西南与日照市接壤；属温带季风气候，著名景点有崂山、八大关等。唐宋时期，青岛成为贸易口岸；明清时期，是中国北方重要的海防要塞，属山东莱州府境内；1949年6月2日，青岛解放，改属…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('太原','太原（简称“并（bīng）”），别称：并州，山西省省会，是中国优秀旅游城市、国家历史文化名城、国家园林城市，是山西省政治、经济、文化、交通和国际交流中心。 太原位于山西省中北部的太原盆地，北接忻州市，东连阳泉，西交吕梁，南邻晋中市，总面积6988平方千米，境内景点有：永祚寺、凌霄双塔、龙山石窟、蒙山大佛、祭孔文庙、晋阳古城遗址等。
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('重庆','重庆（简称：渝或巴），别称江城、雾都，是中华人民共和国直辖市，是国际大都市、国家中心城市、超大城市、西部大开发重要的战略支点、“一带一路”和长江经济带重要联结点以及内陆开放高地。 重庆地处中国西南部，东邻湖北、湖南，南靠贵州，西接四川，北连陕西；属亚热带季风性湿润气候，著名景点有洪崖洞、大足石刻等。晋朝改永宁郡为巴都郡；民国十八年（1929年），重庆正式建市；1997年3月14日，设立重庆直辖市，撤销原重庆…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('武汉','武汉（简称“汉”），别称“江城”，湖北省省会，有“九省通衢”之称。 武汉地处江汉平原东部、长江中游，长江经济带核心城市，是全国重要的工业基地和科教基地，是中央军委武汉联勤保障基地驻所，也是中国内陆最大的水陆空交通枢纽、长江中游航运中心，其高铁网辐射大半个中国，是华中地区唯一可直航全球五大洲的城市。武汉是国家历史文化名城、楚文化的重要发祥地，境内盘龙城遗址有3500年历史，也是中国民主革命的发祥地。
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('南京','南京（简称：宁），古称金陵、建康，江苏省省会，副省级市、南京都市圈核心城市，是长江国际航运物流中心，长三角辐射带动中西部地区发展的国家重要门户城市，是中国四大古都之一，是中华文明的重要发祥地，有“六朝古都”、“十朝都会”之称，有“天下文枢”、“东南第一学”的美誉。 南京地处中国东部、长江下游、濒江近海， 位于江苏省西南部，气候类型为亚热带季风气候。著名景点有中山陵、明孝陵、明城墙、玄武湖、夫子庙、…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('沈阳','沈阳，简称沈，是中华人民共和国辽宁省省会及最大城市，别称盛京、奉天。沈阳位于中国东北地区南部，是长三角、珠三角、京津冀地区通往关东地区的综合枢纽城市。沈阳全市总面积逾1.3万平方公里，市区面积3495平方公里，2013年全市常住户籍人口825.7万人，市区户籍人口728万。沈阳是国家历史文化名城，有2300年建城史，素有“一朝发祥地，两代帝王都”之称。沈阳是中国最重要的以装备制造业为主的重工业基地，有着“共和国长子”和…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('大连','大连市，别称滨城，位于辽东半岛辽宁省南端，东濒黄海，西临渤海，是东北亚国际航运中心、东北亚国际物流中心、区域性金融中心、国际花园城市，有“东北之窗”、“北方明珠”之称。
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('济南','济南市，简称“济”，别称“泉城”，是山东省省会、副省级市、环渤海地区南翼的中心城市，山东省的政治、文化、教育、经济、交通和科技中心。中国人民解放军北部战区陆军机关驻地，山东半岛城市群和济南都市圈核心城市。 因境内泉水众多，拥有“七十二名泉”，被称为“泉城”，素有“四面荷花三面柳，一城山色半城湖”的美誉，八景闻名于世，是拥有“山、泉、湖、河、城”独特风貌的旅游城市，是国家历史文化名城、首批中国优秀旅…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('哈尔滨','哈尔滨，别名冰城、东方莫斯科、东方小巴黎，黑龙江省省会，是中国历史文化名城，金、清两朝发祥地，是热点旅游城市和国际冰雪文化名城。 哈尔滨历史源远流长，是一座从来没有过城墙的城市，元、明时，成为成吉思汗三弟斡斤家族的领地和奴尔干都司的辖地，明末清初，女真人曾用此城遗存的建筑材料在原地修筑阿勒楚喀要塞，1946年，建立人民政权，成为全国解放最早的大城市。哈尔滨属温带季风气候，著名景点有太阳岛、中央大街、亚…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('桂林','桂林，简称桂，是国务院批复确定的国际旅游胜地、国家可持续发展议程创新示范区；联合国世界旅游组织亚太旅游协会旅游趋势与展望国际论坛永久举办地、中央军委桂林联勤保障中心驻所。 桂林北接湖南、贵州，西南连柳州，东邻贺州，属山地丘陵地区及典型喀斯特岩溶地貌，辖17个区（市）县和高新区、总面积2.78万平方公里，2018年户籍人口538.15万人，国家级重点科研中心7个，高校15所。 桂林是中国融贯西南、华南、中南最便捷国际旅…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('长春','长春（简称“长”），吉林省省会、副省级市、东北亚经济圈中心城市，是我国重要的工业基地、国家历史文化名城和全国综合交通枢纽，有“东方底特律”和“东方好莱坞”之称。 长春有着深厚的近代城市底蕴，是著名的中国老工业基地，是新中国最早的汽车工业基地和电影制作基地，同时还是新中国轨道客车、光电技术、应用化学、生物制品等产业发展的摇篮。 长春在汉至西晋时期，为扶余国都，中华民国时期曾是伪满洲国首都，1949年，改…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('扬州','扬州，别称广陵，江苏省地级市，为联合国人居奖获奖城市、国家历史文化名城、中国温泉名城、中国海上丝绸之路8个申报世界遗产城市之一，是南水北调东线工程水源地，有“淮左名都，竹西佳处”之称，享有“中国运河第一城”的美誉。 东部与盐城市、泰州市毗邻，南部濒临长江与镇江市隔江相望，西南部与南京市相连，西部与安徽省滁州市交界，西北部与淮安市接壤；有瘦西湖、盂城驿等景点。1949年1月，设立扬州市，属苏皖边区第二行政…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('拉萨','拉萨，别名逻些、日光城，简称“拉”，是中国西藏自治区的首府，是一个具有高原和民族特色的国际旅游城市，是西藏的政治、经济、文化和科教中心，也是藏传佛教圣地。全年日照时间在3000小时以上，素有“日光城”的美誉。 拉萨市位于西藏自治区东南部，雅鲁藏布江支流拉萨河北岸，拉萨全年多晴朗天气，降雨稀少，冬无严寒，夏无酷暑，气候宜人。拉萨境内蕴藏着丰富的各类资源，相对于全国和自治区其他地市，具有较明显的资源优势。…
                                详情>>
');
INSERT INTO baike(`title`,`content`)value('丽江','丽江市，云南省辖地级市。 “丽江”一名，始于元朝。战国时，属秦国蜀郡。战国末期，为滇国境域。两汉时，滇国降汉，今丽江市属越住嶲郡，称遂久县。1980年，设立丽江地区行政公署。2002年，丽江撤地设市， 丽江自古以来是丝绸之路和茶马古道的中转站，丽江有建于南宋的丽江古城，纳西族名称叫“   巩本知”。著名景点有：丽江古城、 玉龙雪山、 白沙壁画、 虎跳峡、 老君山、 束河古镇等。
                                详情>>
');