list1 = ['Google', '百度', 1997, 2000]
list2 = [1, 2, 3, [2, "茄子", "AWM"], 5, 6, "98k"]
print(list1[1])
print(list2[3][1])  # 列表的嵌套

# a = ["茄子", 99, 3.14, ["土豆", 66, "西红柿"]]
# #获取列表的长度(获取列表中数据的个数)   len()
# print(len(a))
# #追加数据到列表   append()
# a.append("冬枣")
# print(a)
# #从列表中删除数据   remove(0)
# a.remove(99)
# print(a)



# a = ["茄子", 99, 3.14, ["土豆", 66, "西红柿"]]
# #更新数据
# print(a)
# a[0] = "土豆"
# print(a)


# a = ["茄子", 99, 3.14, ["土豆", 66, "西红柿"]]
# del a[2]
# print(a)


# #复制
# a = ["茄子", 99, 3.14, ["土豆", 66, "西红柿"]]
# print(a)
# b = a.copy()
# print(b)



# #排序方式一
# a = [4,324,5,324,22,334,555,6666,1]
# a.sort()
# print(a)


# #排序的方式2
# a = [4, 324, 5, 324, 22, 334, 555, 6666, 1]
# b = sorted(a)
# print(a)
# print(b)



# #最大值和最小值
# a = [4, 324, 5, 324, 22, 334, 555, 6666, 1]
# print(max(a))
# print(min(a))



